{
  "_block_types": [
    "recurrent",
    "recurrent",
    "attention"
  ],
  "architectures": [
    "RecurrentGemmaForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_recurrent_gemma.RecurrentGemmaConfig",
    "AutoModelForCausalLM": "modeling_recurrent_gemma.RecurrentGemmaForCausalLM"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_window_size": 2048,
  "bos_token_id": 151643,
  "conv1d_width": 4,
  "embeddings_scale_by_sqrt_dim": true,
  "eos_token_id": 151645,
  "final_w_init_variance_scale": 0.07692307692307693,
  "head_dim": 256,
  "hidden_activation": "gelu_pytorch_tanh",
  "hidden_size": 2560,
  "intermediate_size": 15360,
  "logits_soft_cap": 30.0,
  "lru_width": 2560,
  "model_type": "recurrent_gemma",
  "num_attention_heads": 10,
  "num_hidden_layers": 26,
  "num_key_value_heads": 1,
  "pad_token_id": 151643,
  "partial_rotary_factor": 0.5,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0.dev0",
  "use_cache": true,
  "vocab_size": 151936,
  "w_init_variance_scale": 0.01
}